require "prawn"

module PDF :: Prawn::Document
  def create_pdf(link, data)
    Prawn::Document.generate((rout "/public/law.pdf"), :margin => [40, 40, 40, 60]) do
      font_families.update(
      "TimesNewRoman" => {
        :bold => "#{link[:bold]}",
        :normal  => "#{link[:normal]}" })
    font "TimesNewRoman", :size => 10
    text "ДОГОВІР", :size => 18, :style => :bold, :align => :center
    move_down(10)
    text "купівлі-продажу", :size => 14, :style => :bold, :align => :center
    move_down(5)
    text "м. #{data[:town]}                      #{data[:date].day}.#{data[:date].month}.#{ data[:date].year}р.",
    :size => 14, :style => :bold
    move_down(10)
    text "#{data[:seller]}, іменований(а) надалі як \"Продавець\", з одного боку, і #{data[:buyer]}, іменований(а) надалі як \"Покупець\", уклали даний Договір про наступне:
    ", :size => 14, :style => :bold, :align => :justify
    move_down(10)

    text "1. ПРЕДМЕТ ДОГОВОРУ.", :size => 14, :style => :bold, :align => :center
    move_down(5)

    text "1.1. За цим договором Продавець зобов'язується передати майно у власність Покупцю, а Покупець зобов'язується прийняти майно і сплатити за нього обговорену грошову суму.
    1.2.	Квартира, що відчужується за даним Договором має наступні характеристики:
    #{data[:specifications]}
    1.3.	Продавець стверджує, що на момент укладення цього договору вказана вище квартира не перебуває під арештом чи забороною, щодо неї не ведуться судові спори, вона не заставлена, у податковій заставі не перебуває, відносно неї не укладено будь-яких договорів з відчуження чи щодо користування з іншими особами, як юридична адреса вона не використовується. Треті особи не мають прав на квартиру.
    1.4.	Відчужувана квартира оглянута Покупцем. Недоліків, яки перешкоджають	використанню квартири за цільовим призначенням на момент огляду не виявлено. Претензій до ПРОДАВЦЯ щодо якісних характеристик відчужуваної квартири покупець не має.
    ", :size => 14, :align => :justify, :style => :normal
    move_down(5)

    text "2. ЦІНА ДОГОВОРУ", :size => 14, :style => :bold, :align => :center
    move_down(5)
    text "2.1.	Продаж квартири за домовленістю сторін вчиняється за #{data[:price]} гривень 00 копійок, які отримані Продавцем від Покупця до оформлення цього договору.
    2.2.	Сторони підтверджують факт повного розрахунку за продану квартиру.
    2.3.	Загальна вартість квартири згідно витягу з реєстру прав власності на нерухоме майно від становить #{data[:price]} гривень 00 копійок.
    ", :size => 14, :style => :normal, :align => :justify
    move_down(5)

    text "3. ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН", :size => 14, :style => :bold, :align => :center
    move_down(5)
    text "3.1.	Обов'язки Продавця:
    3.1.1.	Передати квартиру Покупцю у стані, що відповідає санітарним та технічним нормам щодо житлових приміщень й умовам цього Договору.
    3.1.2.	Попередити Покупця про права третіх осіб на квартиру.
    3.1.3.	Попередити Покупця про всі відомі йому недоліки речі.
    3.1.4.	Зберігати майно у випадку, якщо право власності на майно перейде до покупця раніш передання речі.
    3.2.	Права Продавця:
    3.2.1.	Вимагати сплати встановленої ціни за квартиру відповідно до умов цього Договору
    3.2.2.	Вимагати прийняття квартири Покупцем у стані, що відповідає санітарним та технічним нормам щодо житлових приміщень й умовам цього Договору.
    3.3.	Обов'язки Покупця:
    3.3.1.	Сплатити за квартиру ціну, встановлену цим Договором.
    3.3.2.	Прийняти квартиру у стані, що відповідає санітарним та технічним нормам щодо житлових приміщень й умовам цього Договору.
    3.4.	Права Покупця:
    3.4.1.	Вимагати від Продавця передачі квартири у стані, що відповідає санітарним та технічним нормам щодо житлових приміщень й умовам цього Договору.
    3.4.2.	Вимагати від Продавця виконання інших обов'язків за цим Договором.
    ", :size => 14, :style => :normal, :align => :justify
    move_down(5)

    text "4. ІНШІ УМОВИ", :size => 14, :style => :bold, :align => :center
    move_down(5)
    text "4.1.	Вимоги законодавства щодо змісту й правових наслідків правочину, що укладається сторонами, їм роз'яснено нотаріусом. Сторони підтверджують, що цей Договір не носить характеру мнимої та удаваної угоди.
    4.2.	Витрати у зв'язку з укладенням цього Договору сторони оплачують порівну.
    4.3.	Цей Договір підлягає державній реєстрації. Також необхідно здійснити державну реєстрацію права власності.
    4.4.	Договір укладено у трьох примірниках, два з яких передано сторонам, третій - у справах приватного нотаріуса.
    4.5.	У випадках, не передбачених даним Договором сторони керуються чинним законодавством. Таке ж правило діє у разі протиріччя цього Договору імперативним нормам чинних законодавчих актів.
    4.6.	Відповідальність сторін встановлюється згідно з чинним законодавством.
    4.7.	Всі зміни та доповнення до цього Договору, що зроблені за узгодженням сторін повинні бути нотаріально посвідчені.
    4.8.	Право власності на квартиру у Покупця виникає з моменту державної реєстрації Договору.
    ", :size => 14, :style => :normal, :align => :justify
    move_down(5)

    text "
    Продавець                                     Покупець

    _________________                             ________________", :size => 14, :style => :normal, :align => :center
    end
  end

  def rout short_url
    File.dirname(__FILE__)+short_url
  end
end
